Repository: zhaohon/comePay
Catalog: lib/l10n/app_*.arb
Languages: ar, id

source: Language
ar: اللغة
id: Bahasa

source: Hint
ar: تلميح
id: Petunjuk

# applySetting
source: Apply this setting
ar: تطبيق هذا الإعداد
id: Terapkan pengaturan ini

source: Confirm
ar: تأكيد
id: Konfirmasi

source: English
ar: الإنجليزية
id: Inggris

source: China
ar: الصينية
id: Cina

source: Arabic
ar: العربية
id: Arab

source: Invite friend
ar: دعوة صديق
id: Undang teman

source: KYC
ar: اعرف عميلك

source: Coupon
ar: قسيمة
id: Kupon

source: Customer Service Center
ar: مركز خدمة العملاء
id: Pusat Layanan Pelanggan

source: About us
ar: معلومات عنا
id: Tentang Kami

source: Security
ar: الأمان
id: Keamanan

source: identity verified
ar: تم التحقق من الهوية
id: Identitas terverifikasi

# userIdCopied
source: User ID copied to clipboard
ar: تم نسخ معرف المستخدم إلى الحافظة
id: ID pengguna disalin ke clipboard

source: No email
ar: لا يوجد بريد إلكتروني
id: Tidak ada email

source: No ID
ar: لا يوجد معرف
id: Tidak ada ID

# inviteFriendsRebate
source: Invite Friends Get 50% rebate
ar: دعوة الأصدقاء احصل على 50٪ خصم
id: Undang Teman Dapatkan 50% rebate

# moreFriendsHigherCommission
source: The more friend you invite, the higher commission you get
ar: كلما دعوت المزيد من الأصدقاء، زادت العمولة التي تحصل عليها
id: Semakin banyak teman yang diundang, semakin tinggi komisi yang didapat

# nodePartnerProgram
source: Node partner Program Exclusive Promotion Plan Now Recruiting
ar: برنامج شريك العقدة خطة ترويج حصرية التوظيف الآن
id: Program Mitra Node Rencana Promosi Eksklusif Sekarang Merekrut

# applyHighRebate
source: Apply for high rebate
ar: تقدم للحصول على خصم مرتفع
id: Ajukan rebate tinggi

# shareInvitationLink
source: Share your invitation link with friend
ar: شارك رابط الدعوة الخاص بك مع الأصدقاء
id: Bagikan tautan undangan Anda dengan teman

# friendCompleteRegistration
source: When your friend complete registration
ar: عندما يكمل صديقك التسجيل
id: Ketika teman Anda menyelesaikan pendaftaran

# earnRebates
source: You earn rebates when your friend activates a card or makes transactions
ar: تكسب خصومات عندما يقوم صديقك بتنشيط بطاقة أو إجراء معاملات
id: Anda mendapatkan rebate ketika teman Anda mengaktifkan kartu atau melakukan transaksi

# shareNowCashback
source: Share Now and get cashback
ar: شارك الآن واحصل على استرداد نقدي
id: Bagikan Sekarang dan dapatkan cashback

source: Invitation Code
ar: رمز الدعوة
id: Kode Undangan

source: Invitation Link
ar: رابط الدعوة
id: Tautan Undangan

source: WhatsApp
ar: واتساب

source: Telegram
ar: تيليجرام

source: WeChat
ar: ويشات

source: Current level
ar: المستوى الحالي
id: Tingkat Saat Ini

source: Card Rebate
ar: خصم البطاقة
id: Rebate Kartu

source: Spending rebate
ar: خصم الإنفاق
id: Rebate Pengeluaran

source: Secondary
ar: ثانوي
id: Sekunder

source: Available
ar: متاح
id: Tersedia

source: Expired
ar: منتهي الصلاحية
id: Kadaluarsa

source: Failed to load coupons
ar: فشل في تحميل القسائم
id: Gagal memuat kupon

source: Retry
ar: إعادة المحاولة
id: Coba Lagi

source: No available coupons
ar: لا توجد قسائم متاحة
id: Tidak ada kupon tersedia

source: No used coupons
ar: لا توجد قسائم مستخدمة
id: Tidak ada kupon yang digunakan

source: No expired coupons
ar: لا توجد قسائم منتهية الصلاحية
id: Tidak ada kupon kadaluarsa

source: Expires
ar: تنتهي
id: Kadaluarsa

source: Used
ar: مستخدم
id: Digunakan

# expiredLabel
source: Expired
ar: منتهي الصلاحية
id: Kadaluarsa

source: Coupon Code
ar: رمز القسيمة
id: Kode Kupon

source: Enter a coupon code
ar: أدخل رمز القسيمة
id: Masukkan kode kupon

source: Please enter a coupon code
ar: يرجى إدخال رمز القسيمة
id: Silakan masukkan kode kupon

source: Success
ar: نجح
id: Berhasil

source: Coupon Code binding
ar: ربط رمز القسيمة
id: Pengikatan Kode Kupon

# aboutUsTitle
source: About Us
ar: معلومات عنا
id: Tentang Kami

source: Company Introduction
ar: مقدمة الشركة
id: Pengantar Perusahaan

source: Term of use
ar: شروط الاستخدام
id: Syarat Penggunaan

source: Privacy policy
ar: سياسة الخصوصية
id: Kebijakan Privasi

source: Email
ar: البريد الإلكتروني

source: Phone
ar: الهاتف
id: Telepon

source: Transaction password
ar: كلمة مرور المعاملة
id: Kata sandi transaksi

source: Login password
ar: كلمة مرور تسجيل الدخول
id: Kata Sandi Login

source: Unbound
ar: غير مرتبط
id: Tidak Terikat

source: Set
ar: تعيين
id: Atur

source: Update
ar: تحديث
id: Perbarui

source: Logout
ar: تسجيل الخروج
id: Keluar

source: Logout failed
ar: فشل تسجيل الخروج
id: Logout gagal

source: Modify Email
ar: تعديل البريد الإلكتروني
id: Ubah Email

# modifyEmailWarning
source: To ensure the security of your account, withdraw transactions will be restricted for 24 hour after modifying your email
ar: لضمان أمان حسابك، سيتم تقييد معاملات السحب لمدة 24 ساعة بعد تعديل بريدك الإلكتروني
id: Untuk memastikan keamanan akun Anda, transaksi penarikan akan dibatasi selama 24 jam setelah mengubah email Anda

source: New Email
ar: البريد الإلكتروني الجديد
id: Email Baru

source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني
id: Silakan masukkan email Anda

source: Email verification code
ar: رمز التحقق من البريد الإلكتروني
id: Kode verifikasi email

source: Please enter verification code
ar: يرجى إدخال رمز التحقق
id: Silakan masukkan kode verifikasi

source: Get Code
ar: الحصول على الرمز
id: Dapatkan Kode

source: Sending...
ar: جارٍ الإرسال...
id: Mengirim...

# otpSentToNewEmail
source: OTP sent to your new email
ar: تم إرسال رمز التحقق إلى بريدك الإلكتروني الجديد
id: OTP dikirim ke email baru Anda

source: Failed to send OTP
ar: فشل في إرسال رمز التحقق
id: Gagal mengirim OTP

source: Verification method
ar: طريقة التحقق
id: Metode verifikasi

source: Email verification
ar: التحقق من البريد الإلكتروني
id: Verifikasi email

source: Verifying...
ar: جارٍ التحقق...
id: Memverifikasi...

# enterEmailVerificationCodeFirst
source: Please enter the email verification code first
ar: يرجى إدخال رمز التحقق من البريد الإلكتروني أولاً
id: Silakan masukkan kode verifikasi email terlebih dahulu

# newEmailVerifiedOtpSentToCurrent
source: New email verified, OTP sent to current email
ar: تم التحقق من البريد الإلكتروني الجديد، وتم إرسال رمز التحقق إلى البريد الإلكتروني الحالي
id: Email baru diverifikasi, OTP dikirim ke email saat ini

source: Failed to verify new email
ar: فشل في التحقق من البريد الإلكتروني الجديد
id: Gagal memverifikasi email baru

# enterVerificationCode
source: Please enter the verification code
ar: يرجى إدخال رمز التحقق
id: Silakan masukkan kode verifikasi

source: Email changed successfully
ar: تم تغيير البريد الإلكتروني بنجاح
id: Email berhasil diubah

source: Failed to change email
ar: فشل في تغيير البريد الإلكتروني
id: Gagal mengubah email

source: Bind Phone
ar: ربط الهاتف
id: Ikat Telepon

# bindPhoneWarning
source: To ensure the security of your account, withdraw transactions will be restricted for 24 hour after modifying your number
ar: لضمان أمان حسابك، سيتم تقييد معاملات السحب لمدة 24 ساعة بعد تعديل رقمك
id: Untuk memastikan keamanan akun Anda, transaksi penarikan akan dibatasi selama 24 jam setelah mengubah nomor Anda

source: New Phone
ar: الهاتف الجديد
id: Telepon Baru

source: Please enter your number
ar: يرجى إدخال رقمك
id: Silakan masukkan nomor Anda

source: Phone verification code
ar: رمز التحقق من الهاتف
id: Kode verifikasi telepon

source: OTP sent to your phone
ar: تم إرسال رمز التحقق إلى هاتفك
id: OTP dikirim ke telepon Anda

source: Email OTP sent successfully
ar: تم إرسال رمز التحقق من البريد الإلكتروني بنجاح
id: OTP email berhasil dikirim

source: Phone number changed successfully
ar: تم تغيير رقم الهاتف بنجاح
id: Nomor telepon berhasil diubah

source: Confirming...
ar: جارٍ التأكيد...
id: Mengonfirmasi...

source: Email not found. Please log in again.
ar: البريد الإلكتروني غير موجود. يرجى تسجيل الدخول مرة أخرى.
id: Email tidak ditemukan. Silakan masuk lagi.

source: Error occurred
ar: حدث خطأ
id: Terjadi kesalahan

source: Set Transaction Password
ar: تعيين كلمة مرور المعاملة
id: Atur Kata Sandi Transaksi

# setTransactionPasswordWarning
source: To ensure the security of your account, withdraw transactions will be restricted for 24 hours after modifying your transaction password
ar: لضمان أمان حسابك، سيتم تقييد معاملات السحب لمدة 24 ساعة بعد تعديل كلمة مرور المعاملة الخاصة بك
id: Untuk memastikan keamanan akun Anda, transaksi penarikan akan dibatasi selama 24 jam setelah mengubah kata sandi transaksi Anda

source: Please enter the 6 digit transaction code
ar: يرجى إدخال رمز المعاملة المكون من 6 أرقام
id: Silakan masukkan kode transaksi 6 digit

source: Confirm transaction password
ar: تأكيد كلمة مرور المعاملة
id: Konfirmasi kata sandi transaksi

source: Please enter the confirmation transaction password
ar: يرجى إدخال كلمة مرور المعاملة التأكيدية
id: Silakan masukkan kata sandi transaksi konfirmasi

source: Verification code
ar: رمز التحقق
id: Kode verifikasi

source: OTP sent to your email
ar: تم إرسال رمز التحقق إلى بريدك الإلكتروني
id: OTP dikirim ke email Anda

source: Transaction password set successfully
ar: تم تعيين كلمة مرور المعاملة بنجاح
id: Kata sandi transaksi berhasil diatur

source: Modify login password
ar: تعديل كلمة مرور تسجيل الدخول
id: Ubah kata sandi login

# modifyLoginPasswordWarning
source: To ensure the security of your account, withdraw transactions will be restricted for 24 hours after modifying your transaction password
ar: لضمان أمان حسابك، سيتم تقييد معاملات السحب لمدة 24 ساعة بعد تعديل كلمة مرور معاملتك
id: Untuk memastikan keamanan akun Anda, transaksi penarikan akan dibatasi selama 24 jam setelah mengubah kata sandi transaksi Anda

source: Old password
ar: كلمة المرور القديمة
id: Kata sandi lama

source: Please enter the old password
ar: يرجى إدخال كلمة المرور القديمة
id: Silakan masukkan kata sandi lama

source: New password
ar: كلمة مرور جديدة
id: Kata sandi baru

source: Please enter a new password
ar: يرجى إدخال كلمة مرور جديدة
id: Silakan masukkan kata sandi baru

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة
id: Konfirmasi kata sandi baru

source: Please enter to confirm the new password
ar: يرجى إدخال لتأكيد كلمة المرور الجديدة
id: Silakan masukkan untuk mengonfirmasi kata sandi baru

source: Welcome to PokePay
ar: مرحبا بك في PokePay
id: Selamat datang di PokePay

source: Welcome to Come Come Pay
ar: مرحبا بك في Come Come Pay

source: Total Assets
ar: إجمالي الأصول 👁️
id: Total Aset üëÅÔ∏è

source: Account
ar: الحساب
id: Akun

source: Deposit
ar: الإيداع

source: Withdrawal
ar: السحب
id: Penarikan

source: Send
ar: إرسال
id: Kirim

source: Receive
ar: استلام
id: Terima

source: SWAP
ar: مبادلة

source: Fund flow
ar: تدفق الأموال
id: Arus Dana

source: Latest Transactions
ar: أحدث المعاملات
id: Transaksi Terbaru

source: See All Transactions
ar: عرض جميع المعاملات
id: Lihat Semua Transaksi

source: No relevant data yet
ar: لا توجد بيانات ذات صلة بعد
id: Belum ada data relevan

source: Come Come Pay Card
ar: بطاقة Come Come Pay

source: No monthly Fee
ar: لا رسوم شهرية
id: Tidak ada biaya bulanan

source: Low transaction Fee
ar: رسوم معاملات منخفضة
id: Biaya transaksi rendah

# spendCryptoLikeFiat
source: Spend crypto like fiat! Binding card, POS terminals, ATMs. Apply now and ready to use upon activation!
ar: أنفق العملات المشفرة مثل العملة الورقية! ربط البطاقة، محطات نقاط البيع، الصرافات الآلية. تقدم الآن وجاهز للاستخدام عند التنشيط!
id: Belanjakan crypto seperti fiat! Kartu pengikatan, terminal POS, ATM. Ajukan sekarang dan siap digunakan setelah aktivasi!

source: Apply Now
ar: تقدم الآن
id: Ajukan Sekarang

source: Message Service Center
ar: مركز خدمة الرسائل
id: Pusat Layanan Pesan

source: Login to your account
ar: تسجيل الدخول إلى حسابك
id: Masuk ke akun Anda

source: Password
ar: كلمة المرور
id: Kata Sandi

source: Login
ar: تسجيل الدخول
id: Masuk

# forgotUserOrPassword
source: Forgot User / Password ?
ar: نسيت اسم المستخدم أو كلمة المرور؟
id: Lupa nama pengguna atau kata sandi?

source: Don't have an account?
ar: ليس لديك حساب؟
id: Belum memiliki akun?

source: Sign Up
ar: تسجيل الدخول
id: Daftar

source: Get Started
ar: ابدأ الآن
id: Mulai

source: Welcome Back
ar: مرحباً بك مرة أخرى
id: Selamat datang kembali

source: Please enter the code
ar: يرجى إدخال رمز التحقق
id: Silakan masukkan kode verifikasi

source: We sent email to
ar: تم إرسال رمز التحقق إلى
id: Kami telah mengirim kode verifikasi ke

source: Didn't get a code?
ar: لم تستلم رمز التحقق؟
id: Tidak mendapatkan kode verifikasi?

source: Send again
ar: إرسال مرة أخرى
id: Kirim ulang

# verify
source: Verify OTP
ar: تحقق OTP
id: Verifikasi OTP

source: For every dream with Come Come Pay
ar: للمميزات التي تقدمها Come Come Pay

# fasility
source: A facility that provides you financial assistance whenever you need.
ar: أداة تقدم لك مساعدة finansial كلما تحتاجها.
id: Sebuah fasilitas yang memberikan bantuan finansial kepada Anda setiap kali Anda membutuhkannya.

source: Skip
ar: تخطي
id: Lewati

# manageCripto
source: Manage Your Crypto Asset And Payments with Come Pay
ar: إدارة الأصول الرقمية والدفقات
id: Manajemen Aset Kripto dan Pembayaran

# manageCriptoDesc
source: A convenient way to manage your money securely from mobile device.
ar: إمكانية إدارة أموالك الرقمية وإجراء عمليات الدفع بسهولة من جهازك المحمول.
id: Sebuah layanan yang memudahkan Anda mengelola aset kripto dan pembayaran dengan aman dari perangkat mobile.

source: Verification Success
ar: نجح التحقق
id: Verifikasi Berhasil

# verificationSuccessDesc
source: You have successfully created a new password, click continue to enter the application.
ar: تهانينا حسابك جاهز للاستخدام، الآن يمكنك البدء
id: Selamat akun Anda siap digunakan, sekarang Anda bisa mulai

source: Start Now
ar: ابدأ الآن
id: Mulai Sekarang

source: Confirm Your Email
ar: تأكيد بريدك الإلكتروني
id: Konfirmasi Email

# didnReceive
source: didn’t receive
ar: لم تستلم رمز التحقق؟
id: Tidak menerima kode verifikasi?

source: My Email
ar: البريد الإلكتروني الخاص بي
id: Email Saya

source: Create Password
ar: إنشاء كلمة مرور
id: Buat Kata Sandi

# passwordMustBe8Characters
source: The password must be 8 characters, including 1 uppercase letter, 1 number and 1 special character.
ar: كلمة المرور يجب أن تكون 8 أحرف، بما في ذلك 1 حرف كبير، 1 رقم، و1 حرف خاص.
id: Kata sandi harus terdiri dari 8 karakter, termasuk 1 huruf kapital, 1 angka, dan 1 karakter khusus.

source: Confirm Password
ar: تأكيد كلمة المرور
id: Konfirmasi Kata Sandi

# continues
source: Continue
ar: متابعة
id: Lanjutkan

source: Entered
ar: تم إدخال
id: Diterima

source: Password Reset
ar: إعادة تعيين كلمة المرور
id: Reset Kata Sandi

# enterRegisterEmailPassword
source: Please enter your registered email address to reset your password
ar: يرجى إدخال بريدك الإلكتروني الذي تم التسجيل به لتعيين كلمة مرور جديدة
id: Silakan masukkan email yang terdaftar untuk mereset kata sandi

source: Email address
ar: البريد الإلكتروني
id: Alamat email

# policies
source: By continuing, you agree to our Terms & Conditions and Privacy Policy. Your data will be securely encrypted with TLS.
ar: بằng cách المتابعة، فإنك توافق على شروط الخدمة والأحكام الخاصة بنا وموافقتنا على سياسة الخصوصية. سيتم تشفير بياناتك بشكل آمن باستخدام TLS.
id: Dengan melanjutkan, Anda menyetujui syarat dan ketentuan kami serta kebijakan privasi. Data Anda akan dienkripsi dengan aman menggunakan TLS.

source: We just sent you an email to
ar: لقد أرسلنا للتو رسالة إلى بريدك الإلكتروني
id: Kami baru saja mengirim email ke

source: What’s Your email?
ar: ما هو بريدك الإلكتروني؟
id: Apa email Anda?

source: Enter the email address you want to use to register with CCP
ar: أدخل عنوان البريد الإلكتروني الذي تريد استخدامه للتسجيل مع ComeComePay
id: Masukkan alamat email yang ingin Anda gunakan untuk mendaftar dengan Demo

source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح
id: Silakan masukkan alamat email yang valid

source: Have an account?
ar: لديك حساب؟
id: Sudah memiliki akun?

source: Log in here
ar: تسجيل الدخول هنا
id: Masuk di sini

source: New OTP sent to your email
ar: تم إرسال رمز التحقق الجديد إلى بريدك الإلكتروني
id: OTP baru dikirim ke email Anda

source: Failed to resend OTP
ar: فشل في إعادة إرسال رمز التحقق
id: Gagal mengirim ulang OTP

source: Please fill all OTP fields
ar: يرجى ملء جميع حقول رمز التحقق
id: Silakan isi semua kolom OTP

source: Password cannot be empty
ar: لا يمكن أن تكون كلمة المرور فارغة
id: Kata sandi tidak boleh kosong

# passwordMustBeAtLeast8Characters
source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل
id: Kata sandi harus minimal 8 karakter

# passwordMustContainUppercase
source: Password must contain an uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير
id: Kata sandi harus mengandung huruf kapital

# passwordMustContainNumber
source: Password must contain a number
ar: يجب أن تحتوي كلمة المرور على رقم
id: Kata sandi harus mengandung angka

# passwordMustContainSpecial
source: Password must contain a special character
ar: يجب أن تحتوي كلمة المرور على رمز خاص
id: Kata sandi harus mengandung karakter khusus

source: Please confirm your password
ar: يرجى تأكيد كلمة المرور الخاصة بك
id: Silakan konfirmasi kata sandi Anda

source: Passwords do not match
ar: كلمات المرور غير متطابقة
id: Kata sandi tidak cocok

source: Password set successfully!
ar: تم تعيين كلمة المرور بنجاح!
id: Kata sandi berhasil diatur!

source: Failed to set password
ar: فشل في تعيين كلمة المرور
id: Gagal mengatur kata sandi

# referralCodeLabel
source: Referral Code:
ar: رمز الإحالة:
id: Kode Referral:

source: I agree with
ar: أوافق على
id: Saya setuju dengan

# termsAndConditions
source: Terms & Conditions
ar: الشروط والأحكام
id: Syarat & Ketentuan

source: Register
ar: تسجيل
id: Daftar

source: Message Center
ar: مركز الرسائل
id: Pusat Pesan

source: System Notification
ar: إشعارات النظام
id: Notifikasi Sistem

source: Message Detail
ar: تفاصيل الرسالة
id: Detail Pesan

source: Dear User
ar: عزيزي المستخدم
id: Pesanan Anda

source: Subject
ar: الموضوع
id: Subjek

source: Details
ar: تفاصيل
id: Detail

source: Status
ar: الحالة

source: Read At
ar: وقت القراءة
id: Waktu Dibaca

source: Thank you for using ComeComePay!
ar: شكرًا لك على استخدام Come Come Pay!

# searchTokenHint
source: Search token...
ar: ابحث عن الرمز...
id: Cari token...

# selectNetwork
source: Select a Network
ar: اختر شبكة
id: Pilih Jaringan

source: Swap from
ar: مبادلة من
id: Tukar dari

# tokenLabel
source: Token
ar: رمز

# walletTitle
source: Wallet
ar: المحفظة
id: Dompet

source: Market Statistics
ar: إحصائيات السوق
id: Statistik Pasar

source: Transaction History
ar: تاريخ المعاملات
id: Riwayat Transaksi

# sentStatus
source: Sent
ar: مرسل
id: Dikirim

# receiveStatus
source: Receive
ar: مستلم
id: Diterima

source: Apply Virtual Card
ar: تطبيق البطاقة الافتراضية
id: Ajukan Kartu Virtual

source: Card Information
ar: معلومات البطاقة
id: Informasi Kartu

source: Card Name
ar: اسم البطاقة
id: Nama Kartu

source: Card Organization
ar: منظمة البطاقة
id: Organisasi Kartu

source: Card Fee
ar: رسوم البطاقة
id: Biaya Kartu

source: Fee
ar: الرسوم
id: Biaya

source: Your Gateway
ar: بوابتك

source: to Crypto
ar: إلى العملات المشفرة

source: Simple, Secure, Smooth
ar: بسيط، آمن، سلس

source: Manage Your
ar: أدر

source: Crypto Asset
ar: أصولك المشفرة

source: And Payments with Come Pay
ar: ومدفوعاتك مع Come Pay

source: Create a Password
ar: إنشاء كلمة مرور

# confirmPasswordLabel
source: Confirm password
ar: تأكيد كلمة المرور

# byRegisteringYouAccept
source: By registering you accept our
ar: بالتسجيل فإنك تقبل

# andPrivacyPolicy
source: and
ar: و

# yourDataWillBeSecure
source: Your data will be security encrypted with TLS.
ar: سيتم تشفير بياناتك بشكل آمن باستخدام TLS.

source: Original Fee
ar: الرسوم الأصلية

source: Actual Payment
ar: الدفع الفعلي

source: Payment Required
ar: الدفع مطلوب
id: Pembayaran Diperlukan

source: Go Back
ar: عودة
id: Kembali

source: Cancel
ar: إلغاء
id: Batal

source: Payment successful!
ar: تم الدفع بنجاح!

source: Confirm Payment
ar: تأكيد الدفع

source: Amount to Pay
ar: المبلغ للدفع

source: Select Coupon
ar: اختر قسيمة

source: No coupon
ar: لا توجد قسيمة

source: Apply Card
ar: طلب بطاقة

source: Failed to load card fee
ar: فشل تحميل رسوم البطاقة

source: Code
ar: رمز

source: Insufficient
ar: غير كاف

source: Please select
ar: الرجاء الاختيار
id: Silakan pilih

# skipButton
source: Skip
ar: تخطي
id: Lewati

# appUpgradeTitle
source: ComeComePay Upgrade
ar: ترقية ComeComePay
id: Upgrade Demo

# upgradeAppButton
source: Upgrade ComeComePay
ar: ترقية ComeComePay
id: Upgrade Demo

# updateDefaultMessage
source: Please update ComeComePay to the latest version. The version you are using is out of date and may stop working soon.
ar: يرجى تحديث ComeComePay إلى أحدث إصدار. الإصدار الذي تستخدمه قديم وقد يتوقف عن العمل قريبًا.
id: Silakan perbarui Demo ke versi terbaru. Versi yang Anda gunakan sudah usang dan mungkin akan segera berhenti bekerja.

source: Press again to exit
ar: اضغط مرة أخرى للخروج
id: Tekan lagi untuk keluar

# moreButton
source: More
ar: المزيد
id: Lebih Banyak

# noTransactionsYet
source: You don't have any transaction records yet
ar: ليس لديك أي سجلات معاملات بعد
id: Anda belum memiliki catatan transaksi

# startFirstTransaction
source: Start your first transaction
ar: ابدأ معاملتك الأولى
id: Mulai transaksi pertama Anda

# noCardsAvailable
source: No cards available, please apply for a card first
ar: لا توجد بطاقات متاحة، يرجى التقدم للحصول على بطاقة أولاً
id: Tidak ada kartu tersedia, silakan ajukan kartu terlebih dahulu

# pleaseEnterValidAmount
source: Please enter a valid amount
ar: يرجى إدخال مبلغ صالح
id: Silakan masukkan jumlah yang valid

# pleaseSelectCard
source: Please select a card
ar: يرجى اختيار بطاقة
id: Silakan pilih kartu

# balanceInsufficient
source: Insufficient balance
ar: الرصيد غير كافٍ
id: Saldo tidak mencukupi

# swapSuccess
source: Swap successful
ar: تمت المبادلة بنجاح
id: Swap berhasil!

source: Swap failed
ar: فشلت المبادلة
id: Swap gagal

source: Loading failed
ar: فشل التحميل
id: Gagal memuat

# retryButton
source: Retry
ar: إعادة المحاولة
id: Coba Lagi

# goBackButton
source: Go Back
ar: العودة
id: Kembali

source: Select Card
ar: اختر بطاقة
id: Pilih Kartu

source: Select Currency
ar: اختر العملة
id: Pilih Mata Uang

source: Swap Preview
ar: معاينة المبادلة
id: Pratinjau Swap

source: Swap Amount
ar: مبلغ التبادل
id: Jumlah Tukar

source: Net Received
ar: صافي المستلم
id: Diterima Bersih

source: Exchange Rate
ar: سعر الصرف
id: Nilai Tukar

source: Fee Rate
ar: معدل الرسوم
id: Tarif Biaya

source: Fee Amount
ar: مبلغ الرسوم
id: Jumlah Biaya

# cancelButton
source: Cancel
ar: إلغاء
id: Batal

source: Confirm Swap
ar: تأكيد المبادلة
id: Konfirmasi Swap

source: Please enter recipient address
ar: يرجى إدخال عنوان المستلم
id: Silakan masukkan alamat penerima

source: Withdrawal failed
ar: فشل السحب
id: Penarikan gagal

# scanQRCodeInDevelopment
source: Scan QR code feature in development
ar: ميزة مسح رمز الاستجابة السريعة قيد التطوير
id: Fitur pindai kode QR sedang dalam pengembangan

source: Address copied
ar: تم نسخ العنوان
id: Alamat disalin

source: Please enter 6-digit code
ar: يرجى إدخال رمز مكون من 6 أرقام
id: Silakan masukkan kode 6 digit

source: Application failed
ar: فشل التطبيق
id: Aplikasi gagal

source: Available Credit Estimate
ar: تقدير الائتمان المتاح
id: Estimasi Kredit Tersedia

# okButton
source: OK
ar: موافق

# getCardInfoFailed
source: Failed to get card information
ar: فشل الحصول على معلومات البطاقة
id: Gagal mendapatkan informasi kartu

source: Currency
ar: العملة
id: Mata Uang

# cardApplicationSuccess
source: Card application successful
ar: تم تقديم طلب البطاقة بنجاح
id: Aplikasi kartu berhasil

source: Card application failed
ar: فشل تقديم طلب البطاقة
id: Aplikasi kartu gagal

source: Card Application Progress
ar: تقدم طلب البطاقة
id: Progres Aplikasi Kartu
