Repository: zhaohon/comePay
Catalog: lib/l10n/app_*.arb
Languages: ar, id

# cardApplicationFailedRetry
source: Card application failed, please try again later
ar: فشل تقديم طلب البطاقة، يرجى المحاولة مرة أخرى لاحقًا
id: Aplikasi kartu gagal, silakan coba lagi nanti

source: Loading...
ar: جار التحميل...
id: Memuat...

source: Waiting to process
ar: في انتظار المعالجة
id: Menunggu untuk diproses

source: Processing
ar: قيد المعالجة
id: Memproses

source: Completed
ar: مكتمل
id: Selesai

source: Failed
ar: فشل
id: Gagal

# cardsCreatedSuccessfully
source: Successfully created {count} card(s)
ar: تم إنشاء {count} بطاقة بنجاح
id: Berhasil membuat {count} kartu

source: Recipient
ar: المستلم
id: Penerima

source: Sum
ar: المبلغ
id: Jumlah

source: Gas fee
ar: رسوم الغاز
id: Biaya gas

source: Comment
ar: تعليق
id: Komentar

# textForRecipientOptional
source: Text for the recipient (Optional)
ar: نص للمستلم (اختياري)
id: Teks untuk penerima (Opsional)

source: Detail Transaction
ar: تفاصيل المعاملة
id: Detail Transaksi

source: Confirm and Send
ar: تأكيد وإرسال
id: Konfirmasi dan Kirim

source: Not set
ar: غير محدد
id: Tidak diatur

# areYouSureLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟
id: Apakah Anda yakin ingin keluar?

source: Update Profile
ar: تحديث الملف الشخصي
id: Perbarui Profil

source: First Name
ar: الاسم الأول
id: Nama Depan

source: Last Name
ar: الاسم الأخير
id: Nama Belakang

source: Date of Birth
ar: تاريخ الميلاد
id: Tanggal Lahir

source: Account Type
ar: نوع الحساب
id: Jenis Akun

source: Referral Code
ar: رمز الإحالة
id: Kode Referral

source: Save
ar: حفظ
id: Simpan

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح
id: Profil berhasil diperbarui

source: Failed to update profile
ar: فشل تحديث الملف الشخصي
id: Gagal memperbarui profil

source: Message
ar: رسالة
id: Pesan

source: OTP Send
ar: إرسال رمز التحقق
id: Kirim OTP

# continueButton
source: Continue
ar: متابعة
id: Lanjutkan

source: No available currencies
ar: لا توجد عملات متاحة
id: Tidak ada mata uang yang tersedia

source: Authorization Record
ar: سجل التفويض
id: Catatan Otorisasi

source: Verification
ar: التحقق
id: Verifikasi

source: Invalid Input
ar: إدخال غير صالح
id: Input Tidak Valid

source: Verification failed
ar: فشل التحقق
id: Verifikasi gagal

# enterPasswordToConfirmTransaction
source: Enter your password to confirm the transaction
ar: أدخل كلمة المرور لتأكيد المعاملة
id: Masukkan kata sandi Anda untuk mengonfirmasi transaksi

source: Transaction Details
ar: تفاصيل المعاملة
id: Detail Transaksi

source: Spent Currency
ar: العملة المستهلكة
id: Mata Uang Terpakai

source: Transaction Type
ar: نوع المعاملة
id: Jenis Transaksi

source: Transaction Time
ar: وقت المعاملة
id: Waktu Transaksi

source: Completion Time
ar: وقت الانتهاء
id: Waktu Penyelesaian

source: Address
ar: العنوان
id: Alamat

source: Tx Hash
ar: تجزئة المعاملة

source: Swap To
ar: تبادل إلى
id: Tukar Ke

source: Description
ar: الوصف
id: Deskripsi

source: Transaction List
ar: قائمة المعاملات
id: Daftar Transaksi

source: No Transactions
ar: لا توجد معاملات
id: Tidak Ada Transaksi

source: Load Failed
ar: فشل التحميل
id: Gagal Memuat

source: Reload
ar: إعادة التحميل
id: Muat Ulang

source: No more data
ar: لا مزيد من البيانات
id: Tidak ada data lagi

source: Referral Code (Optional)
ar: رمز الإحالة (اختياري)
id: Kode Referral (Opsional)

# enterReferralCode
source: Enter referral code if you have one
ar: أدخل رمز الإحالة إذا كان لديك
id: Masukkan kode referral jika Anda memilikinya

# myWalletAddress
source: My {currency} wallet address: {address}
ar: عنوان محفظتي {currency}: {address}

source: Wallet Address
ar: عنوان المحفظة

# receiveNetworkWarning
source: Only support receiving {currency} network assets, other network assets cannot be recovered.
ar: يدعم فقط استلام أصول شبكة {currency}، لا يمكن استرداد أصول الشبكات الأخرى.

source: Share Address
ar: مشاركة العنوان

source: No Receive Address
ar: لا يوجد عنوان استلام

# coinNoAddressGenerated
source: No address generated for this coin
ar: لم يتم إنشاء عنوان لهذه العملة

# receiveTitle
source: Receive
ar: استلام

# receiveCoin
source: Receive {currency}
ar: استلام {currency}

source: Recipient Address
ar: عنوان المستلم

source: Enter or paste address
ar: أدخل أو الصق العنوان

source: Amount
ar: المبلغ

# balanceAvailable
source: Available: {balance} {symbol}
ar: متاح: {balance} {symbol}

source: All
ar: الكل

# withdrawFailedWithError
source: Withdraw failed: {error}
ar: فشل السحب: {error}

source: Withdraw History
ar: سجل السحب

source: No withdraw history
ar: لا يوجد سجل سحب

source: Pull to refresh
ar: اسحب للتحديث

# withdrawRecordPrefix
source: Withdraw Record #
ar: سجل سحب #

source: No Data
ar: لا توجد بيانات

# statusApproved
source: Approved
ar: موافق عليه

# statusPending
source: Pending
ar: قيد الانتظار

# statusRejected
source: Rejected
ar: مرفوض

# typeDeposit
source: Deposit
ar: إيداع

# typeWithdraw
source: Withdraw
ar: سحب

# typeSwap
source: Swap
ar: تبادل

# typeCardFee
source: Card Fee
ar: رسوم البطاقة

# typeCommission
source: Commission
ar: عمولة

# typeTransfer
source: Transfer
ar: تحويل

# typeFee
source: Fee
ar: رسوم

# statusCompleted
source: Completed
ar: مكتمل

# statusFailed
source: Failed
ar: فشل

# statusCancelled
source: Cancelled
ar: ملغى

# statusCredited
source: Credited
ar: مقيد

# availableAmountEstimateDesc
source: Estimated available amount after transaction fees and exchange rate fluctuations
ar: المبلغ المقدر المتاح بعد رسوم المعاملة وتقلبات أسعار الصرف

source: Lock Card
ar: قفل البطاقة

source: Card Authorization
ar: تفويض البطاقة

source: Apply Physical Card
ar: طلب بطاقة فعلية

source: Report Loss
ar: الإبلاغ عن فقدان

source: Bill
ar: فاتورة

# expiryDateLabel
source: Expiry Date:
ar: تاريخ الانتهاء:

# transactionDefault
source: Transaction
ar: معاملة

# billDetail
source: Bill Details
ar: تفاصيل الفاتورة

source: Order ID
ar: معرف الطلب

# copySuccess
source: Copied to clipboard
ar: تم النسخ إلى الحافظة

# balanceLabel
source: Balance
ar: الرصيد

source: Transaction ID
ar: معرف المعاملة

source: My Invitation
ar: دعوتي

source: Total Friends
ar: إجمالي الأصدقاء

source: Level 1 Friends
ar: أصدقاء المستوى 1

source: Level 2 Friends
ar: أصدقاء المستوى 2

source: My Friends
ar: أصدقائي

source: Total Card Rebate
ar: إجمالي خصم البطاقة

source: Level 1 Card Rebate
ar: خصم بطاقة المستوى 1

source: Level 2 Card Rebate
ar: خصم بطاقة المستوى 2

# cardRebateAction
source: Card Rebate
ar: خصم البطاقة

source: Total Transaction Rebate
ar: إجمالي خصم المعاملات

source: Level 1 Transaction Rebate
ar: خصم معاملات المستوى 1

source: Level 2 Transaction Rebate
ar: خصم معاملات المستوى 2

# transactionRebateAction
source: Transaction Rebate
ar: خصم المعاملات

# level1FriendsTab
source: Level 1 Friends
ar: أصدقاء المستوى 1

# level2FriendsTab
source: Level 2 Friends
ar: أصدقاء المستوى 2

# registrationTimeLabel
source: Registration Time:
ar: وقت التسجيل:

# level1CardTab
source: Level 1 Card
ar: بطاقة المستوى 1

# level2CardTab
source: Level 2 Card
ar: بطاقة المستوى 2

# level1TransactionTab
source: Level 1 Transaction
ar: معاملة المستوى 1

# level2TransactionTab
source: Level 2 Transaction
ar: معاملة المستوى 2

source: Pay Fee
ar: دفع الرسوم

# transactionSettlementAmount
source: Settlement Amount
ar: مبلغ التسوية

source: Rebate
ar: خصم

source: Consumption Rebate
ar: خصم الاستهلاك

source: Card Opening
ar: فتح البطاقة

source: Consumption
ar: استهلاك

# cardOpeningTimeLabel
source: Open Time:
ar: وقت الفتح:

# transactionSettlementTimeLabel
source: Settlement Time:
ar: وقت التسوية:

# paymentCompletedKycPrompt
source: You have completed the card fee payment. You can now proceed with KYC verification.
ar: لقد أكملت دفع رسوم البطاقة. يمكنك الآن المتابعة مع التحقق من الهوية (KYC).

source: Go to Verify
ar: اذهب للتحقق

source: Coupon Discount
ar: خصم القسيمة

# failToLoadCardFeeConfig
source: Failed to load card fee config
ar: فشل تحميل إعدادات رسوم البطاقة

# failToLoadPaymentCurrencies
source: Failed to load payment currencies
ar: فشل تحميل عملات الدفع

source: No payment currencies available
ar: لا توجد عملات دفع متاحة

# pleaseSelectPaymentCurrency
source: Please select a payment currency
ar: يرجى اختيار عملة الدفع

# failToCreatePayment
source: Failed to create payment
ar: فشل إنشاء الدفع

source: Account Notification
ar: إشعارات الحساب

source: System Announcement
ar: إعلانات النظام

source: Mark All as Read
ar: تحديد الكل كمقروء

source: Notification Settings
ar: إعدادات الإشعارات

source: Announcement Detail
ar: تفاصيل الإعلان

source: Notification Detail
ar: تفاصيل الإشعار

source: Content Detail
ar: تفاصيل المحتوى

source: No Notifications
ar: لا توجد إشعارات

source: No Announcements
ar: لا توجد إعلانات

source: Load More Failed
ar: فشل تحميل المزيد

source: Refreshing...
ar: جاري التحديث...

source: Invalid Date
ar: تاريخ غير صالح

source: Publish Time
ar: وقت النشر

source: Authorization List
ar: قائمة التفويض

# featureComingSoon
source: Feature under development
ar: الميزة قيد التطوير

source: Unlock Card
ar: فتح البطاقة

source: Card locked successfully
ar: تم قفل البطاقة بنجاح

source: Card unlocked successfully
ar: تم فتح البطاقة بنجاح

source: Failed to lock card
ar: فشل قفل البطاقة

source: Failed to unlock card
ar: فشل فتح البطاقة

# confirmLockTitle
source: Lock Card
ar: تأكيد القفل

# confirmLockContent
source: Are you sure you want to lock this card? You will not be able to use it for payments until you unlock it.
ar: هل أنت متأكد من أنك تريد قفل هذه البطاقة؟ لن تتمكن من استخدامها للمدفوعات حتى تقوم بفتحها.

# confirmUnlockTitle
source: Unlock Card
ar: تأكيد الفتح

# confirmUnlockContent
source: Are you sure you want to unlock this card?
ar: هل أنت متأكد من أنك تريد فتح هذه البطاقة؟

source: Card Security Info
ar: معلومات أمان البطاقة

source: Card Number
ar: رقم البطاقة

source: Expiry Date
ar: تاريخ الانتهاء

source: CVV Code
ar: رمز CVV

source: PIN Code
ar: الرقم السري

# insufficientBalanceForCoin
source: {coin} Balance Insufficient
ar: رصيد {coin} غير كافٍ

source: Failed to get preview
ar: فشل الحصول على المعاينة

# swapFailedWithMessage
source: Swap failed: {message}
ar: فشل المبادلة: {message}

# swapHistoryTitle
source: Swap History
ar: سجل المبادلة

source: No swap history
ar: لا يوجد سجل مبادلة

source: Consumed
ar: المستهلكة

source: Transfer to card
ar: تحويل إلى البطاقة

source: Transfer from card
ar: تحويل من البطاقة

source: (Recharge to card)
ar: (شحن إلى البطاقة)

source: (Withdraw from card)
ar: (سحب من البطاقة)

# swapAction
source: Swap
ar: مبادلة

# getAmount
source: Get
ar: احصل على

# enterAmount
source: Please enter amount
ar: يرجى إدخال المبلغ

source: Getting rate...
ar: جار الحصول على السعر...

source: Error
ar: خطأ

source: Reviewing
ar: مراجعة

source: Under Review
ar: قيد المراجعة

# kycReviewDesc
source: Your KYC verification is currently under review. This usually takes a few minutes.
ar: جاري مراجعة التحقق من هويتك. يستغرق هذا عادةً بضع دقائق.

source: Verify Failed
ar: فشل التحقق

# verificationFailedTitle
source: Verification Failed
ar: فشل التحقق

# verificationFailedReason
source: Reason: {reason}
ar: السبب: {reason}

# verificationFailedDesc
source: Your verification failed. Please try again.
ar: فشل التحقق الخاص بك. يرجى المحاولة مرة أخرى.

source: Retry Verification
ar: أعد محاولة التحقق

source: Verification Passed
ar: تم التحقق بنجاح

# receiveCardEligibilityDesc
source: Congratulations! You are eligible to receive your card.
ar: تهانينا! أنت مؤهل لاستلام بطاقتك.

source: Receive Card Now
ar: استلم البطاقة الآن

# verificationRequiredTitle
source: Verification Required
ar: التحقق مطلوب

# kycRequiredDesc
source: You need to complete KYC verification before issuing a card.
ar: تحتاج إلى إكمال التحقق من الهوية (KYC) قبل إصدار البطاقة.

source: Transaction Ref
ar: مرجع المعاملة

# paymentVerificationTimedOut
source: Payment verification timed out. Please try again.
ar: نفدت مهلة التحقق من الدفع. يرجى المحاولة مرة أخرى.

# paymentNotCompleted
source: Payment not completed: {status}
ar: لم يكتمل الدفع: {status}

# paymentFailed
source: Payment Failed: {error}
ar: فشل الدفع: {error}

# failedToReceiveCard
source: Failed to receive card: {error}
ar: فشل استلام البطاقة: {error}

source: Min Fee
ar: الحد الأدنى للرسوم

source: Submit
id: Kirim
